src/Documents/СписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.Поступление</xr:Item>
				<xr:Item>Document.НачислениеЗарплаты</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Сертификаты</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПодотчетниками</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаЛицевыхСчетах</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID_Транзакции</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгодоприобретатель</Name>
					<Comment>Применяется для оплаты с ЛС по родству</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаЗПАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаЗПДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаЗПМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаЗПРежимФормирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Comment>Кассовая смена</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетКонтрагента</Name>
					<Comment>Лицевой счет списания или зачисления денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатСерийныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВТаблице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Comment>Тип денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингКодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингНомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингСсылочныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингНомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
								<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеДополнительное</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАванс</Name>
							<Comment>Это аванс от контрагента</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Comment>Вид возвращаемого налога</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/РасчетыСПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПерсоналом</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СписаниеДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ
Перем БлокировкаОбработчикаКорректировкиДокументовОснования Экспорт;  // Блокировка обработчика корректировки документов основания

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнение реквизитов документа по умолчанию
	Дата               = ТекущаяДатаСеанса();
	ТипДенежныхСредств = ?(НЕ ЗначениеЗаполнено(ТипДенежныхСредств), Перечисления.ТипыДенежныхСредств.Наличные, ТипДенежныхСредств);
	ВидОперации        = ?(НЕ ЗначениеЗаполнено(ВидОперации), Перечисления.ВидыОпераций.ВозвратОплатыКлиенту, ВидОперации);
	Касса              = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнаяКасса;
	ЭквайрингТерминал  = Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса);
	СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
    Сотрудник          = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
    АвторДокумента	   = ПараметрыСеанса.ТекущийПользователь;
	
	Если НЕ Константы.ИспользоватьВидыЛицевыхСчетов.Получить() 
		ИЛИ Справочники.ВидыЛицевыхСчетов.ВернутьВидыЛицевыхСчетов().Количество() = 1 Тогда
		ЛицевойСчетКонтрагента = Справочники.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет;
	КонецЕсли;
	
	Если ДанныеЗаполнения <> Неопределено Тогда		
		// Заполнение из переданной структуры данных
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда			
			ВидОперации           		= ?(ДанныеЗаполнения.Свойство("ВидОперации"), ДанныеЗаполнения.ВидОперации, ВидОперации);	
			ТипДенежныхСредств     		= ?(ДанныеЗаполнения.Свойство("ТипДенежныхСредств"), ДанныеЗаполнения.ТипДенежныхСредств, ТипДенежныхСредств);		
			ЛицевойСчетКонтрагента	 	= ?(ДанныеЗаполнения.Свойство("ЛицевойСчетКонтрагента"), ДанныеЗаполнения.ЛицевойСчетКонтрагента, ЛицевойСчетКонтрагента);
			Касса             	   		= ?(ДанныеЗаполнения.Свойство("Касса"), ДанныеЗаполнения.Касса, Касса);
			БанковскийСчетКонтрагента	= ?(ДанныеЗаполнения.Свойство("БанковскийСчетКонтрагента"), ДанныеЗаполнения.БанковскийСчетКонтрагента, БанковскийСчетКонтрагента);
			Статья             	   		= ?(ДанныеЗаполнения.Свойство("Статья"), ДанныеЗаполнения.Статья, Статья);
			Комментарий             	= ?(ДанныеЗаполнения.Свойство("Комментарий"), ДанныеЗаполнения.Комментарий, Комментарий);
			
			Если ДанныеЗаполнения.Свойство("ЭквайринговыйТерминал") Тогда
				ЭквайрингТерминал = ДанныеЗаполнения.ЭквайринговыйТерминал;
			Иначе
				ЭквайрингТерминал = ?(ДанныеЗаполнения.Свойство("Касса"),
										Справочники.ЭквайринговыеТерминалы.ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса),
										ЭквайрингТерминал);	
			КонецЕсли;
			
			СуммаДокумента         = ?(ДанныеЗаполнения.Свойство("СуммаДокумента"), ДанныеЗаполнения.СуммаДокумента, СуммаДокумента);	
			// Предназначено для заполнения из данных таблицы "Оплата" подготавливаемых
			// обработкой помощи проведения оплаты
			Если ДанныеЗаполнения.Свойство("СтрокаТаблицыОплата") Тогда
			    СтрокаТаблицыОплата           = ДанныеЗаполнения.СтрокаТаблицыОплата;
				ТипДенежныхСредств            = СтрокаТаблицыОплата.ТипДенежныхСредств;
				ЛицевойСчетКонтрагента        = СтрокаТаблицыОплата.ВидЛицевогоСчета;
				Сертификат                    = СтрокаТаблицыОплата.Сертификат;
				СертификатСерийныйНомер       = СтрокаТаблицыОплата.СертификатСерийныйНомер;
				ЭквайрингВидПлатежнойКарты    = СтрокаТаблицыОплата.ЭквайрингВидПлатежнойКарты;
				ЭквайрингНомерПлатежнойКарты  = СтрокаТаблицыОплата.ЭквайрингНомерПлатежнойКарты;				
			КонецЕсли;			
		Иначе				
			// Заполнение на основании документа "ВозвратОтПокупателя"
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратОтПокупателя")Тогда	
				// Если в документе основания в виде оплаты лежит страховой полис
				Если ЗначениеЗаполнено(ДанныеЗаполнения.ПолисМедСтрахования) Тогда 
					ВидОперации               = Перечисления.ВидыОпераций.ВозвратОплатыСтраховойКомпании;
					ТипДенежныхСредств        = Перечисления.ТипыДенежныхСредств.Безналичные;
					Контрагент                = ДанныеЗаполнения.ПолисМедСтрахования.СтраховаяКомпания
				Иначе
					ВидОперации               = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту;
					Контрагент                = ДанныеЗаполнения.Контрагент;				
				КонецЕсли;	
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				// Получаем временную таблицу из таблиц лечение и запасы
				ВременнаТаблица = ДанныеЗаполнения.Лечение.Выгрузить(,"ДокументАванса,Всего");
				Для Каждого СтрокаТ ИЗ ДанныеЗаполнения.Запасы Цикл
					НоваяСтрока = ВременнаТаблица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТ);
				КонецЦикла;
				// Это необходимо если в реквизите будет указан тип, он не свернется
				Для Каждого СтрокаТ ИЗ ВременнаТаблица Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
						СтрокаТ.ДокументАванса = Неопределено;
					КонецЕсли;
				КонецЦикла;;	
				// Сворачиваем по документу аванса
				ВременнаТаблица.Свернуть("ДокументАванса","Всего");
				// Заполняем таблицу расшифровки
				Для Каждого СтрокаТ ИЗ ВременнаТаблица Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
						НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
						НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
						НоваяСтрока.Сумма             = СтрокаТ.Всего;
					Иначе 
						// Вычитаем сумму внесенного аванса
						НайденныеСтроки               = ДанныеЗаполнения.УчтенныеАвансы.НайтиСтроки(Новый Структура("ДокументАванса",СтрокаТ.ДокументАванса));
						СуммаАванса                   = ?(НайденныеСтроки.Количество() > 0,НайденныеСтроки[0].СуммаАванса,0);
						СуммаСтроки                   = ?(СуммаАванса < СтрокаТ.Всего,СтрокаТ.Всего - СуммаАванса,0);
						Если СуммаСтроки  > 0 Тогда
							НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
							НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
							НоваяСтрока.ДокументАванса    = СтрокаТ.ДокументАванса;
							НоваяСтрока.Сумма             = СуммаСтроки;  
						КонецЕсли;					
					КонецЕсли;
				КонецЦикла;
				
				// Заполнение кассы, если Возврат от покупателя на основании Приема
				ДокументОснования = ДанныеЗаполнения.ДокументОснования;
				Если ЗначениеЗаполнено(ДокументОснования) 
					И ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.Прием")
					И ЗначениеЗаполнено(ДокументОснования.Касса) Тогда
					Касса = ДокументОснования.Касса;
				КонецЕсли;
								
				// Заполнение на основании документа "ЗаказПоставщику"
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику")
			    ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда			
				ВидОперации                   = Перечисления.ВидыОпераций.ОплатаПоставщику;
				ТипДенежныхСредств            = Перечисления.ТипыДенежныхСредств.Безналичные;
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Контрагент                    = ДанныеЗаполнения.Контрагент;
				СуммаДокумента                = ДанныеЗаполнения.СуммаДокумента; 							
				НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
				НоваяСтрока.Сумма             = ДанныеЗаполнения.СуммаДокумента;
				// Заполнение на основании документа "НачислениеЗарплаты"
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты")Тогда				
				ВидОперации                   = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты;
				ВыплатаЗПРежимФормирования    = 1;
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Сотрудник                     = ДанныеЗаполнения.Сотрудник;
				ВыплатаЗПДокументОснования    = ДанныеЗаполнения;				
				// Заполняем таблицу расшифровки по данным документа начисления
				ТаблицаЗадолженностей = РегистрыНакопления.РасчетыСПерсоналом.ПолучитьТаблицуЗадолженностиПередПерсоналом(,ВыплатаЗПДокументОснования,СтруктурнаяЕдиница,,Ссылка);
		        РасшифровкаПлатежа.Загрузить(ТаблицаЗадолженностей);					
				СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");
				ВыплатаЗПМесяц = НачалоМесяца(ВыплатаЗПДокументОснования.ДатаНачалаПериода);
				// Заполнение на основании документа "Реализация"
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Реализация")
				ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
				ТипДенежныхСредств            = Перечисления.ТипыДенежныхСредств.ЛицевойСчет;
				ВидОперации                   = Перечисления.ВидыОпераций.ОплатаОтКлиента;
				СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
				Контрагент                    = ДанныеЗаполнения.Контрагент;
				Сотрудник                     = ДанныеЗаполнения.Сотрудник;
				СуммаДокумента                = ДанныеЗаполнения.СуммаДокумента; 								
				НоваяСтрока                   = РасшифровкаПлатежа.Добавить();
				НоваяСтрока.ДокументОснования = ДанныеЗаполнения;
				НоваяСтрока.Сумма             = ДанныеЗаполнения.СуммаДокумента;	
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ПеречислениеСсылка.ТипыДенежныхСредств") Тогда
				ТипДенежныхСредств = ДанныеЗаполнения; 
				
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") 
				И ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОпераций.ОплатаОтКлиента Тогда	
				
				ЭтотОбъект.ВидОперации                  = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту;
				ЭтотОбъект.ТипДенежныхСредств           = ДанныеЗаполнения.ТипДенежныхСредств;
				ЭтотОбъект.Контрагент                   = ДанныеЗаполнения.Контрагент;
				ЭтотОбъект.СтруктурнаяЕдиница           = ДанныеЗаполнения.СтруктурнаяЕдиница;
				ЭтотОбъект.Касса                        = ДанныеЗаполнения.Касса;
				ЭтотОбъект.БанковскийСчет               = ДанныеЗаполнения.БанковскийСчет;
				ЭтотОбъект.БанковскийСчетКонтрагента    = ДанныеЗаполнения.БанковскийСчетКонтрагента;
				ЭтотОбъект.ЭквайрингНомерПлатежнойКарты = ДанныеЗаполнения.ЭквайрингНомерПлатежнойКарты;
				ЭтотОбъект.ЭквайрингСсылочныйНомер      = ДанныеЗаполнения.ЭквайрингСсылочныйНомер;
				ЭтотОбъект.ЭквайрингНомерЧека           = ДанныеЗаполнения.ЭквайрингНомерЧека;
				ЭтотОбъект.ЭквайрингТерминал            = ДанныеЗаполнения.ЭквайрингТерминал;
				ЭтотОбъект.СуммаДокумента               = ДанныеЗаполнения.СуммаДокумента;
				
				Для Каждого СтрокаТ ИЗ ДанныеЗаполнения.РасшифровкаПлатежа Цикл
					
					НоваяСтрока = ЭтотОбъект.РасшифровкаПлатежа.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТ);
					НоваяСтрока.Статья               	= Справочники.СтатьиДоходовИРасходов.ВозвратОшибочнойОплатыКлиенту;
					НоваяСтрока.ОснованиеДополнительное = ДанныеЗаполнения;
					
				КонецЦикла;
				
				ЭтотОбъект.Комментарий = "Отмена оплаты по документу: " + ДанныеЗаполнения;
				
			КонецЕсли;	
		    // Установка суммы документ
		    СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");
		КонецЕсли;	
		// Установка банковского счета контрагента по умолчанию(при указанных условиях)
		Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		   И НЕ ВидОперации     = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета
		   И НЕ ВидОперации     = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты
		   И НЕ ЗначениеЗаполнено(БанковскийСчетКонтрагента) 
		   И ЗначениеЗаполнено(Контрагент) Тогда	
		   БанковскийСчетКонтрагента = Контрагент.БанковскийСчетПоУмолчанию;
	   ИначеЕсли  ВидОперации  = Перечисления.ВидыОпераций.СдачаНаличныхВБанк
		   И НЕ ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
	       БанковскийСчетКонтрагента = СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	   КонецЕсли;   
	   Если ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные
		   И НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда	
		   БанковскийСчет = СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию;
	   КонецЕсли; 
	   
	КонецЕсли;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	 СуммаДокумента = 0;
	 НомерЧекаККМ   = 0;
	 РасшифровкаПлатежа.Очистить();
	 КодСинхронизации  = ""; 
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	 
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Перем МассивВсехРеквизитов;
	МассивОбязательныхРеквизитов = Новый Массив;
	//
	Документы.СписаниеДенежныхСредств.ПолучитьМассивыОбязательныхРеквизитов(ЭтотОбъект,
	МассивОбязательныхРеквизитов);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ДенежныеСредстваСервер.ЗаполнитьМассивНепроверяемыхРеквизитовПоОбъекту(ЭтотОбъект,
	МассивОбязательныхРеквизитов,
	МассивНепроверяемыхРеквизитов
	);
	// Если в документе заполнена колонка документ авнса
	// необходимость в обязательном заполнении колнки
	// Документ основания отпадает, ее необходимо исключить
	НомерСтроки = МассивОбязательныхРеквизитов.Найти("РасшифровкаПлатежа.ДокументОснования");
	Если НомерСтроки <> Неопределено Тогда
		Для Каждого СтрокаТ ИЗ РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
				МассивОбязательныхРеквизитов.Удалить(НомерСтроки);
				МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.ДокументОснования");
				Прервать;
			КонецЕсли;	 	
		КонецЦикла;
	КонецЕсли;
	//
	ДенежныеСредстваСервер.УдалитьНепроверяемыеРеквизитыИзМассива(
	ПроверяемыеРеквизиты,
	МассивНепроверяемыхРеквизитов
	);
	
	ДенежныеСредстваСервер.ПроверитьЗаполнениеРасшифровкиПлатежа(
	ЭтотОбъект,
	СуммаДокумента,
	ВидОперации,
	Отказ
	);
	
КонецПроцедуры

// Обработчик перед записью объекта
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Затраты.Итог("Сумма") > СуммаДокумента Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Сумма затрат не может превышать сумму документа!";
		Сообщение.Поле = "Объект.СуммаДокумента";
		Сообщение.УстановитьДанные(Ссылка);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;	
	Префикс = "";
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, Истина, Префикс);
	
	// Проверка возможности отмены проведения документа
	Если ЗначениеЗаполнено(НомерЧекаККМ) И  РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ пробит на фискальном регистраторе. Отмена проведения не возможна!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	// Прописываем кассовую смену в документ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЗначениеЗаполнено(КассоваяСмена) Тогда
		 СостояниеКассовойСмены   = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);
	     КассоваяСмена            = ?(ЗначениеЗаполнено(СостояниеКассовойСмены),СостояниеКассовойСмены.КассоваяСмена,Неопределено);
	КонецЕсли;	
	// Если нет ни одной строки расшифровки, добавляем строку с суммой документа.
	// Это необходимо т.к. отборы для проводок проводятся из ТЧ
	Если РасшифровкаПлатежа.Количество() = 0 Тогда	
		НоваяСтрока          = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ЭтоАванс = ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту;
		НоваяСтрока.Сумма    = СуммаДокумента;	
		// При операции выплаты ЗП если в шапке не указали документ основания необходимо 
		// подставить его из табличной части
	ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты
		И ВыплатаЗПРежимФормирования = 1
		И НЕ ЗначениеЗаполнено(ВыплатаЗПДокументОснования) Тогда
		
		ВыплатаЗПДокументОснования = РасшифровкаПлатежа[0].ДокументОснования;
		ВыплатаЗПМесяц             = НачалоМесяца(ВыплатаЗПДокументОснования.ДатаНачалаПериода);
	КонецЕсли;	
	// Проверка заполнения статьи расходов в шапке
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Статья) Тогда
		ЭтотОбъект.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(ЭтотОбъект.ВидОперации,ЭтотОбъект.РасшифровкаПлатежа[0].ЭтоАванс);
	КонецЕсли;
	// Необходимо проставить этот флаг если это аванс(или сбросить его если клиент изменил вид операции сущ. документа) 	
	Для Каждого СтрокаТ ИЗ РасшифровкаПлатежа Цикл
		// Проставляем признак авансового платежа
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументОснования) Тогда
			СтрокаТ.ЭтоАванс          = ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОплатыКлиенту;
			СтрокаТ.ДокументОснования = Неопределено;// Для недопущения пустых ссылок в регистре.
		Иначе
			 СтрокаТ.ЭтоАванс          = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
			СтрокаТ.ДокументАванса = Неопределено;// Для недопущения пустых ссылок в регистре.
		ИначеЕсли ЗначениеЗаполнено(СтрокаТ.ДокументАванса) Тогда
			СтрокаТ.ЭтоАванс = Истина;
		КонецЕсли;
		// Проверка заполнения статьи расходов в ТЧ
		Если ЭтотОбъект.СтатьяВТаблице = Ложь И (НЕ ЗначениеЗаполнено(СтрокаТ.Статья) ИЛИ СтрокаТ.Статья <> ЭтотОбъект.Статья) Тогда
			СтрокаТ.Статья = ЭтотОбъект.Статья;
		ИначеЕсли ЭтотОбъект.СтатьяВТаблице = Истина И НЕ ЗначениеЗаполнено(СтрокаТ.Статья) Тогда
			СтрокаТ.Статья = Справочники.СтатьиДоходовИРасходов.ПолучитьСтатьюПоУмолчаниюДляОперации(ЭтотОбъект.ВидОперации,СтрокаТ.ЭтоАванс);
		КонецЕсли;	
	КонецЦикла;

	// Проверка сумм выплаты сотрудникам при операции выплата заработной платы
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ВидОперации = Перечисления.ВидыОпераций.ВыплатаЗаработнойПлаты Тогда	
		// Если данные выбираются по остаткам на месяц начисления
		Если ВыплатаЗПРежимФормирования = 0  И НЕ ВыплатаЗПАванс Тогда		
			ТаблицаОстатковПоЗадолженности = РегистрыНакопления.РасчетыСПерсоналом.ПолучитьТаблицуЗадолженностиПередПерсоналом(ВыплатаЗПМесяц,,СтруктурнаяЕдиница,,Ссылка);		
		// Если данные выбираются из конкретного документа начисления	
		ИначеЕсли ВыплатаЗПРежимФормирования = 1 Тогда	
			ТаблицаОстатковПоЗадолженности = РегистрыНакопления.РасчетыСПерсоналом.ПолучитьТаблицуЗадолженностиПередПерсоналом(,ВыплатаЗПДокументОснования,СтруктурнаяЕдиница,,Ссылка);
		КонецЕсли;		
		Если НЕ ТаблицаОстатковПоЗадолженности = Неопределено Тогда		
			Счетчик = 0;
			Для Каждого СтрокаТЧ ИЗ РасшифровкаПлатежа Цикл	
				 
				НайденныеСтроки    = ТаблицаОстатковПоЗадолженности.НайтиСтроки(Новый Структура("Сотрудник, ДокументОснования",СтрокаТЧ.Сотрудник,СтрокаТЧ.ДокументОснования));
				СуммаЗадолженности = ?(НайденныеСтроки.Количество() = 0,0,НайденныеСтроки[0].Сумма);
				Если СуммаЗадолженности < СтрокаТЧ.Сумма Тогда
					
					Отказ = Истина;
					Текст = НСтр("ru = 'Для сотрудника " +СтрокаТЧ.Сотрудник+ " сумма выплаты " +СтрокаТЧ.Сумма+ " превышает сумму задолженности " +СуммаЗадолженности+ "'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					Текст,
					ЭтотОбъект,
					"РасшифровкаПлатежа["+Счетчик+"].Сумма",);				
				КонецЕсли;			
				Счетчик = Счетчик + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Если виды лицевых счетов в системе не используются, необходимо проставить вид ЛС по умолчанию 
	Если (ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратСЛицевогоСчета
		ИЛИ ЭтотОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет)
		И Константы.ИспользоватьВидыЛицевыхСчетов.Получить() = Ложь
		И НЕ ЗначениеЗаполнено(ЭтотОбъект.ЛицевойСчетКонтрагента) Тогда
		 ЭтотОбъект.ЛицевойСчетКонтрагента = Справочники.ВидыЛицевыхСчетов.ОсновнойЛицевойСчет;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ID_Транзакции) Тогда 
		ID_Транзакции = Новый УникальныйИдентификатор;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);	
	
    // Инициализация данных документа.	
	Документы.СписаниеДенежныхСредств.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	ДополнительныеСвойства.ДляПроведения.Вставить("ВыполнятьДвиженияДенежныесредства", Истина);
	
	// Движения по регистрам
	ДвиженияДокументовСервер.ДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.ДенежныеСредстваНаЛицевыхСчетах(ДополнительныеСвойства, Движения, Отказ);		
	ДвиженияДокументовСервер.ВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.Сертификаты(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.РасчетыПоЭквайрингу(ДополнительныеСвойства, Движения, Отказ);
	ДвиженияДокументовСервер.РасчетыСПодотчетниками(ДополнительныеСвойства, Движения, Отказ);			
	ДвиженияДокументовСервер.РасчетыСПерсоналом(ДополнительныеСвойства, Движения, Отказ);		
	ДвиженияДокументовСервер.Затраты(ДополнительныеСвойства, Движения, Отказ);	
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);
	
    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	
	
	ЗапретЗаписи = ПроверитьЗапретЗаписиРеквизитаСуммаОплачено();
	Если НЕ ЗапретЗаписи Тогда
		// Запись значения реквизита "сумма оплачено"
		ДенежныеСредстваСервер.ЗаполнитьРеквизитыОплатыДокументаОснования(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Обрабока удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Запись значения реквизита "сумма оплачено"
	ДенежныеСредстваСервер.ЗаполнитьРеквизитыОплатыДокументаОснования(ЭтотОбъект,Истина);

КонецПроцедуры

// Функция проверяет, разрешено или нет записать реквизит сумма оплачено в документы основания.
Функция ПроверитьЗапретЗаписиРеквизитаСуммаОплачено()
	
	// При возврате ошибочной оплаты клиенту Сумма оплачено можно записать только после совершенного возврата. 
	// Иначе при формировании чека значение этого реквизита будет искажено и сформируются неправильные таблицы.
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОпераций.ВозвратОшибочнойОплатыКлиенту Тогда                
		
		Если ЭтотОбъект.Касса.ИспользоватьБезПодключенияОборудования = Истина ИЛИ ЭтотОбъект.НомерЧекаККМ <> 0 Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Ложь;      
	
КонецФункции;

#КонецОбласти

#КонецЕсли
